Miscellaneous/Ruby on Rails/CHICO_SI/app/views/users/edit.html.erb

      <%= f.label :grupos %><br/>
      <%= f.collection_check_boxes :group_ids, Group.all, :id, :nome do |cb| %>
---
SELECT "groups".* FROM "groups"