Miscellaneous/Ruby on Rails/CHICO_SI/app/views/users/show.html.erb

SELECT  1 AS one FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = ?  [["user_id", 4]]
---
<p>Autoridade: <%= @user.authority %></p>
<% if @user.groups.any? %>
  <p>Grupos: <%= render @user.groups %></p>