Miscellaneous/Ruby on Rails/CHICO_SI/app/views/treinos/group_index.html.erb


<% current_user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = ?  [["user_id", 1]]