Miscellaneous/Ruby on Rails/CHICO_SI/app/views/posts/show.html.erb

  <strong>Grupo:</strong>
  <%= @post.group.nome %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]