Miscellaneous/Ruby on Rails/CHICO_SI/app/controllers/events_controller.rb

INSERT INTO "events" ("titulo", "local", "descricao", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["titulo", "olhaso"], ["local", "minha casa"], ["descricao", "festa do pijam"], ["date", "2018-12-13"], ["created_at", "2018-12-09 18:55:59.404299"], ["updated_at", "2018-12-09 18:55:59.404299"]]
---
  def create
    @event = Event.new(event_params)
    @event.criador = current_user.id
    if @event.save

UPDATE "events" SET "descricao" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["descricao", "festa do pijama"], ["updated_at", "2018-12-09 18:37:36.714618"], ["id", 1]]
---
  def update
    if @event.update(event_params)