Miscellaneous/Ruby on Rails/CHICO_SI/app/controllers/groups_controller.rb

INSERT INTO "groups" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Grupo topzera"], ["created_at", "2018-12-10 06:31:18.915485"], ["updated_at", "2018-12-10 06:31:18.915485"]]
---
  def create
    @group = Group.new(group_params)
    if @group.save

UPDATE "groups" SET "nome" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["nome", "Grupo topzera"], ["updated_at", "2018-12-10 02:13:25.648715"], ["id", 1]]
---
  def update
    if @group.update(group_params)