Miscellaneous/Ruby on Rails/CHICO_SI/app/controllers/planos_controller.rb

  def index
    @planos = Plano.all
---
SELECT "planos".* FROM "planos"

  def create
    @plano = Plano.new(plano_params)
    if @plano.save
---
INSERT INTO "planos" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Plano saudo"], ["created_at", "2018-12-10 02:11:13.124873"], ["updated_at", "2018-12-10 02:11:13.124873"]]

  def update
    if @plano.update(plano_params)
---
UPDATE "planos" SET "nome" = ?, "updated_at" = ? WHERE "planos"."id" = ?  [["nome", "Plano saúdo"], ["updated_at", "2018-12-10 02:13:13.727050"], ["id", 1]]

  def set_plano
    @plano = Plano.find(params[:id])
---
SELECT  "planos".* FROM "planos" WHERE "planos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]