Miscellaneous/Ruby on Rails/CHICO_SI/app/controllers/posts_controller.rb

INSERT INTO "posts" ("titulo", "mensagem", "group_id") VALUES (?, ?, ?)  [["titulo", "Post 1"], ["mensagem", "Msg"], ["group_id", 3]]
---
  def create
    @post = Post.new(post_params)
    if @post.save