Miscellaneous/Ruby on Rails/CHICO_SI/app/controllers/treinos_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "user_groups" ON "groups"."id" = "user_groups"."group_id" WHERE "user_groups"."user_id" = ?  [["user_id", 1]]
---
  def group_index
    @groups = current_user.groups

SELECT "treinos".* FROM "treinos"
---
  def index
    @treinos = Treino.all

SELECT  "groups".* FROM "groups" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
  def show
    @group = Group.find_by(params[:group_id])

INSERT INTO "treinos" ("nome", "descricao", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Meudeus"], ["descricao", "Ta funfando"], ["group_id", 2], ["created_at", "2018-12-10 15:34:56.357508"], ["updated_at", "2018-12-10 15:34:56.357508"]]
---
  def create
    @treino = Treino.new(treino_params)
    @treino.group_id = params[:group_id]
    if @treino.save

SELECT  "groups".* FROM "groups" WHERE (6) LIMIT ?  [["LIMIT", 1]]
UPDATE "treinos" SET "nome" = ?, "updated_at" = ? WHERE "treinos"."id" = ?  [["nome", "sdfsdfdsfsdf"], ["updated_at", "2018-12-10 16:12:07.901993"], ["id", 3]]
---
  def update
    @group = Group.find_by(params[:group_id])
    if @treino.update(treino_params)

SELECT  "groups".* FROM "groups" WHERE (6) LIMIT ?  [["LIMIT", 1]]
DELETE FROM "treinos" WHERE "treinos"."id" = ?  [["id", 6]]
---
  def destroy
    @group = Group.find_by(params[:group_id])
    @treino.destroy

SELECT  "treinos".* FROM "treinos" WHERE "treinos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_treino
    @treino = Treino.find(params[:id])