Miscellaneous/Ruby on Rails/CHICO_SI/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "authority", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_current
    @user = User.find(session[:user_id])

UPDATE "users" SET "password_digest" = ?, "nome" = ?, "genero" = ?, "registro" = ?, "telefone" = ?, "rg" = ?, "cpf" = ?, "endereco" = ?, "estado_civil" = ?, "profissao" = ?, "plano" = ?, "agencia" = ?, "conta" = ?, "cref" = ?, "nascimento" = ?, "data_filiacao" = ?, "inicio_plano" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
    if @user.update(user_params)