Miscellaneous/Ruby on Rails/CHICO_SI/app/views/groups/show.html.erb

</p>
<% if @group.users.any? %>
---
SELECT "users".* FROM "users" INNER JOIN "user_groups" ON "users"."id" = "user_groups"."user_id" WHERE "user_groups"."group_id" = ?  [["group_id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "user_groups" ON "users"."id" = "user_groups"."user_id" WHERE "user_groups"."group_id" = ? LIMIT ?  [["group_id", 1], ["LIMIT", 1]]